<?php

/**
 * Text used for user-preference specific views within bookstack.
 */

return [
    'shortcuts' => 'Συντομεύσεις',
    'shortcuts_interface' => 'Συντομεύσεις Πληκτρολογίου Διεπαφής',
    'shortcuts_toggle_desc' => 'Εδώ μπορείτε να ενεργοποιήσετε ή να απενεργοποιήσετε τις συντομεύσεις του συστήματος πληκτρολογίου, που χρησιμοποιούνται για την πλοήγηση και τις ενέργειες.',
    'shortcuts_customize_desc' => 'Μπορείτε να προσαρμόσετε κάθε μία από τις παρακάτω συντομεύσεις. Απλά πατήστε το επιθυμητό συνδυασμό πλήκτρων μετά την επιλογή της εισόδου για μια συντόμευση.',
    'shortcuts_toggle_label' => 'Ενεργοποίηση συντομεύσεων πληκτρολογίου',
    'shortcuts_section_navigation' => 'Πλοήγηση',
    'shortcuts_section_actions' => 'Κοινές ενέργειες',
    'shortcuts_save' => 'Αποθήκευση Συντομεύσεων',
    'shortcuts_overlay_desc' => 'Σημείωση: Όταν οι συντομεύσεις είναι ενεργοποιημένες μια βοηθητική επικάλυψη είναι διαθέσιμη πατώντας "?" που θα τονίσει τις διαθέσιμες συντομεύσεις για ενέργειες που είναι ορατές στην οθόνη.',
    'shortcuts_update_success' => 'Οι προτιμήσεις σας αποθηκεύτηκαν!',
];