<?php

/**
 * Text used for user-preference specific views within bookstack.
 */

return [
    'my_account' => 'Моя учетная запись',

    'shortcuts' => 'Горячие клавиши',
    'shortcuts_interface' => 'Настройки горячих клавиш',
    'shortcuts_toggle_desc' => 'Здесь вы можете включить или отключить горячие клавиши системного интерфейса, используемые для навигации и действий.',
    'shortcuts_customize_desc' => 'Вы можете настроить каждую из горячих клавиш ниже. Просто нажмите комбинацию клавиш после выбора вставки для горячих клавиш.',
    'shortcuts_toggle_label' => 'Горячие клавиши включены',
    'shortcuts_section_navigation' => 'Навигация',
    'shortcuts_section_actions' => 'Общие действия',
    'shortcuts_save' => 'Сохранить горячие клавиши',
    'shortcuts_overlay_desc' => 'Примечание: Когда горячие клавиши включены, вспомогательное наложение доступно через нажатие "?", которая будет подсвечивать доступные горячие клавиши для действий, видимых в настоящее время на экране.',
    'shortcuts_update_success' => 'Настройки горячих клавиш были обновлены!',
    'shortcuts_overview_desc' => 'Управление клавишами быстрого доступа, которые можно использовать для навигации по системному интерфейсу.',

    'notifications' => 'Настройки уведомлений',
    'notifications_desc' => 'Управляйте полученными по электронной почте уведомлениями при выполнении определенных действий в системе.',
    'notifications_opt_own_page_changes' => 'Уведомлять об изменениях в собственных страницах',
    'notifications_opt_own_page_comments' => 'Уведомлять о комментариях на собственных страницах',
    'notifications_opt_comment_replies' => 'Уведомлять об ответах на мои комментарии',
    'notifications_save' => 'Сохранить настройки',
    'notifications_update_success' => 'Настройки уведомлений были обновлены!',
    'notifications_watched' => 'Просмотренные и игнорированные элементы',
    'notifications_watched_desc' => 'Ниже приведены элементы, которые имеют пользовательские настройки наблюдения. Чтобы обновить ваши предпочтения, посмотрите этот пункт и найдите варианты наблюдения в боковой панели.',

    'auth' => 'Доступ и безопасность',
    'auth_change_password' => 'Изменить пароль',
    'auth_change_password_desc' => 'Установите пароль для входа в приложение. Длина пароля должна быть не менее 8 символов.',
    'auth_change_password_success' => 'Пароль был обновлен!',

    'profile' => 'Детали профиля',
    'profile_desc' => 'Управляйте деталями вашей учетной записи, что представляют вас другим пользователям, в дополнение к деталям, используемым для персонализации коммуникации и системы.',
    'profile_view_public' => 'Просмотреть публичный профиль',
    'profile_name_desc' => 'Настройте отображаемое имя, видимое другим пользователям системы через действия, что вы выполняете, и контент, которым вы владеете.',
    'profile_email_desc' => 'Этот адрес электронной почты будет использоваться для уведомлений и, в зависимости от активной системы аутентификации, для доступа к системе.',
    'profile_email_no_permission' => 'К сожалению, у вас нет разрешения на изменение адреса электронной почты. Если вам действительно необходимо его изменить, нужно попросить администратора сделать это.',
    'profile_avatar_desc' => 'Выберите изображение, которое будет использоваться для представления себя другим в системе. По возможности это изображение должно быть квадратным и около 256 пикселей по ширине и высоте.',
    'profile_admin_options' => 'Административные параметры',
    'profile_admin_options_desc' => 'Дополнительные параметры уровня администратора, такие как управление назначением ролей, могут быть найдены для вашей учетной записи в области "Настройки > Пользователи".',

    'delete_account' => 'Удалить аккаунт',
    'delete_my_account' => 'Удалить мой аккаунт',
    'delete_my_account_desc' => 'Это полностью удалит вашу учетную запись из системы. Вы не сможете отменить это действие или восстановить эту учетную запись. Созданный вами контент, такой как созданные страницы и загруженные изображения, останется без изменений.',
    'delete_my_account_warning' => 'Вы уверены, что хотите удалить свой аккаунт?',
];
