<?php
/**
 * Authentication Language Lines
 * The following language lines are used during authentication for various
 * messages that we need to display to the user.
 */
return [

    'failed' => 'यी प्रमाणिकरण जानकारी हाम्रो अभिलेखसँग मेल खाँदैन।',
    'throttle' => 'लगइन प्रयासहरूको संख्या धेरै भएको छ। कृपया :seconds सेकेन्ड पछि पुनः प्रयास गर्नुहोस्।',

    // Login & Register
    'sign_up' => 'साइन अप गर्नुहोस्',
    'log_in' => 'लग इन गर्नुहोस्',
    'log_in_with' => ':socialDriver मार्फत लगइन गर्नुहोस्',
    'sign_up_with' => ':socialDriver प्रयोग गरेर साइन अप गर्नुहोस्',
    'logout' => 'लगआउट',

    'name' => 'नाम',
    'username' => 'प्रयोगकर्ता नाम',
    'email' => 'ईमेल',
    'password' => 'पासवर्ड',
    'password_confirm' => 'पासवर्ड पक्का गर्नुहोस्',
    'password_hint' => 'कम्तिमा 8 अङ्कको हुनुपर्छ',
    'forgot_password' => 'पासवर्ड भुल्नुभयो?',
    'remember_me' => 'मलाई सम्झनुहोस्',
    'ldap_email_hint' => 'कृपया यस खाताको लागि प्रयोग गर्नको लागि इमेल प्रविष्ट गर्नुहोस्।',
    'create_account' => 'खाता बनाउनुहोस्',
    'already_have_account' => 'तपाईंको पहिले नै खाता छ?',
    'dont_have_account' => 'के तपाईंको खाता छैन?',
    'social_login' => 'सामाजिक लगइन',
    'social_registration' => 'सामाजिक दर्ता',
    'social_registration_text' => 'अर्को सेवाबाट दर्ता गर्नुहोस् र लगइन गर्नुहोस्।',

    'register_thanks' => 'दर्ता गर्नुभएकोमा धन्यवाद!',
    'register_confirm' => 'कृपया तपाईंको इमेल जाँच गर्नुहोस् र :appName मा पहुँच पाउनको लागि पुष्टिकरण बटनमा क्लिक गर्नुहोस्।',
    'registrations_disabled' => 'दर्ता हाल बन्द गरिएको छ',
    'registration_email_domain_invalid' => 'त्यो इमेल डोमेनलाई यस आवेदनमा पहुँच छैन',
    'register_success' => 'साइन अप गर्नुभएकोमा धन्यवाद! तपाईं अब दर्ता र लगइन भइसकेका हुनुहुन्छ।',

    // Login auto-initiation
    'auto_init_starting' => 'लगइन प्रयास गर्दै',
    'auto_init_starting_desc' => 'हामी तपाईंको प्रमाणीकरण प्रणालीलाई लगइन प्रक्रिया सुरु गर्नका लागि सम्पर्क गर्दैछौं। यदि 5 सेकेन्डपछि प्रगति हुँदैन भने तलको लिङ्कमा क्लिक गर्न प्रयास गर्नुहोस्।',
    'auto_init_start_link' => 'प्रमाणीकरणसँग अगाडि बढ्नुहोस्',

    // Password Reset
    'reset_password' => 'पासवर्ड रिसेट गर्नुहोस्',
    'reset_password_send_instructions' => 'तपाईंको इमेल तल प्रविष्ट गर्नुहोस् र तपाईंलाई पासवर्ड रिसेट लिङ्क सहितको इमेल पठाइनेछ।',
    'reset_password_send_button' => 'रिसेट लिङ्क पठाउनुहोस्',
    'reset_password_sent' => ':email इमेलमा पासवर्ड रिसेट लिङ्क पठाइनेछ यदि त्यो इमेल ठेगाना प्रणालीमा फेला पारिन्छ भने।',
    'reset_password_success' => 'तपाईंको पासवर्ड सफलतापूर्वक रिसेट गरिएको छ।',
    'email_reset_subject' => ':appName पासवर्ड रिसेट गर्नुहोस्',
    'email_reset_text' => 'तपाईं यो इमेल प्राप्त गर्दै हुनुहुन्छ किनकि हामीले तपाईंको खाताको लागि पासवर्ड रिसेट अनुरोध प्राप्त गर्यौं।',
    'email_reset_not_requested' => 'यदि तपाईंले पासवर्ड रिसेट अनुरोध गर्नुभएको छैन भने, अगाडि कुनै कार्य आवश्यक पर्दैन।',

    // Email Confirmation
    'email_confirm_subject' => ':appName मा तपाईंको इमेल पुष्टि गर्नुहोस्',
    'email_confirm_greeting' => ':appName मा सामेल हुनुभएकोमा धन्यवाद!',
    'email_confirm_text' => 'कृपया तलको बटनमा क्लिक गरेर तपाईंको इमेल ठेगाना पुष्टि गर्नुहोस्:',
    'email_confirm_action' => 'इमेल पुष्टि गर्नुहोस्',
    'email_confirm_send_error' => 'इमेल पुष्टिकरण आवश्यक छ तर प्रणालीले इमेल पठाउन सकेन। इमेल सही तरिकाले सेटअप गरिएको छ भनी सुनिश्चित गर्न प्रशासकलाई सम्पर्क गर्नुहोस्।',
    'email_confirm_success' => 'तपाईंको इमेल पुष्टि भएको छ! अब तपाईं यो इमेल ठेगाना प्रयोग गरेर लगइन गर्न सक्षम हुनुहुनेछ।',
    'email_confirm_resent' => 'पुष्टिकरण इमेल पुनः पठाइएको छ, कृपया तपाईंको इनबक्स जाँच गर्नुहोस्।',
    'email_confirm_thanks' => 'पुष्टिकरणको लागि धन्यवाद!',
    'email_confirm_thanks_desc' => 'कृपया केही समय कुर्नुहोस् जबकि तपाईंको पुष्टिकरण प्रक्रिया गरिन्छ। यदि तपाईंलाई 3 सेकेन्ड पछि पुनः रिडिरेक्ट गरिएको छैन भने, तलको "अगाडि बढ्नुहोस्" लिङ्कमा क्लिक गर्नुहोस्।',

    'email_not_confirmed' => 'इमेल ठेगाना पुष्टि गरिएको छैन',
    'email_not_confirmed_text' => 'तपाईंको इमेल ठेगाना अझै पुष्टि भएको छैन।',
    'email_not_confirmed_click_link' => 'कृपया तपाईंले दर्ता गर्दा पठाइएको इमेलमा रहेको लिङ्कमा क्लिक गर्नुहोस्।',
    'email_not_confirmed_resend' => 'यदि तपाईंलाई इमेल भेट्न गाह्रो भइरहेको छ भने, तपाईं तलको फारम द्वारा पुष्टिकरण इमेल पुनः पठाउन सक्नुहुन्छ।',
    'email_not_confirmed_resend_button' => 'पुष्टिकरण इमेल पुनः पठाउनुहोस्',

    // User Invite
    'user_invite_email_subject' => ':appName मा सामेल हुनका लागि तपाईंलाई आमन्त्रित गरिएको छ!',
    'user_invite_email_greeting' => ':appName मा तपाईंको खाता सिर्जना गरिएको छ।',
    'user_invite_email_text' => 'खाता पासवर्ड सेट गर्न र पहुँच प्राप्त गर्न तलको बटनमा क्लिक गर्नुहोस्:',
    'user_invite_email_action' => 'खाता पासवर्ड सेट गर्नुहोस्',
    'user_invite_page_welcome' => ':appName मा स्वागत छ!',
    'user_invite_page_text' => 'तपाईंको खाता अन्तिम रूप दिन र पहुँच प्राप्त गर्न तपाईंलाई पासवर्ड सेट गर्न आवश्यक छ जुन भविष्यका भ्रमणमा :appName मा लगइन गर्न प्रयोग हुनेछ।',
    'user_invite_page_confirm_button' => 'पासवर्ड पक्का गर्नुहोस्',
    'user_invite_success_login' => 'पासवर्ड सेट गरिएको छ, तपाईं अब तपाईंको सेट गरिएको पासवर्ड प्रयोग गरेर :appName मा लगइन गर्न सक्षम हुनुहुनेछ!',

    // Multi-factor Authentication
    'mfa_setup' => 'मल्टि-फ्याक्टर प्रमाणीकरण सेटअप गर्नुहोस्',
    'mfa_setup_desc' => 'तपाईंको प्रयोगकर्ता खाता सुरक्षा थप गर्न मल्टि-फ्याक्टर प्रमाणीकरण सेटअप गर्नुहोस्।',
    'mfa_setup_configured' => 'पहिले नै कन्फिगर गरिएको',
    'mfa_setup_reconfigure' => 'पुनः कन्फिगर गर्नुहोस्',
    'mfa_setup_remove_confirmation' => 'के तपाईं यो मल्टि-फ्याक्टर प्रमाणीकरण विधि हटाउन चाहानुहुन्छ?',
    'mfa_setup_action' => 'सेटअप',
    'mfa_backup_codes_usage_limit_warning' => 'तपाईंको ५ भन्दा कम ब्याकअप कोड बाँकी छन्, कृपया नयाँ सेट उत्पन्न गर्नुहोस् र सुरक्षित स्थानमा राख्नुहोस् ताकि तपाईंको खाता लकडाउन नहोस्।',
    'mfa_option_totp_title' => 'मोबाइल एप',
    'mfa_option_totp_desc' => 'मल्टि-फ्याक्टर प्रमाणीकरण प्रयोग गर्नको लागि तपाईंलाई Google Authenticator, Authy वा Microsoft Authenticator जस्ता TOTP समर्थित मोबाइल एपको आवश्यकता पर्छ।',
    'mfa_option_backup_codes_title' => 'ब्याकअप कोड',
    'mfa_option_backup_codes_desc' => 'एक सेट ब्याकअप कोड उत्पन्न गर्दछ जसलाई तपाईंले लगइन गर्दा आफ्नो पहिचान प्रमाणित गर्न प्रयोग गर्नुहुनेछ। यी सुरक्षित स्थानमा राख्नुहोस्।',
    'mfa_gen_confirm_and_enable' => 'पुष्टिकरण र सक्षम गर्नुहोस्',
    'mfa_gen_backup_codes_title' => 'ब्याकअप कोड सेटअप',
    'mfa_gen_backup_codes_desc' => 'तलको कोडहरूको सूची सुरक्षित स्थानमा राख्नुहोस्। प्रणालीमा पहुँच गर्दा तपाईंले एक कोडलाई दोस्रो प्रमाणीकरण विधिका रूपमा प्रयोग गर्नुहुनेछ।',
    'mfa_gen_backup_codes_download' => 'कोडहरू डाउनलोड गर्नुहोस्',
    'mfa_gen_backup_codes_usage_warning' => 'प्रत्येक कोड एक पटक मात्र प्रयोग गर्न सकिन्छ।',
    'mfa_gen_totp_title' => 'मोबाइल एप सेटअप',
    'mfa_gen_totp_desc' => 'मल्टि-फ्याक्टर प्रमाणीकरण प्रयोग गर्नको लागि तपाईंलाई Google Authenticator, Authy वा Microsoft Authenticator जस्ता TOTP समर्थित मोबाइल एपको आवश्यकता पर्छ।',
    'mfa_gen_totp_scan' => 'सुरु गर्नको लागि तलको QR कोड स्क्यान गर्नुहोस्।',
    'mfa_gen_totp_verify_setup' => 'सेटअप प्रमाणित गर्नुहोस्',
    'mfa_gen_totp_verify_setup_desc' => 'सुनिश्चित गर्नका लागि एक कोड प्रविष्ट गर्नुहोस्, तपाईंको प्रमाणीकरण एपबाट उत्पन्न गरिएको, तलको इनपुट बक्समा:',
    'mfa_gen_totp_provide_code_here' => 'तपाईंको एपबाट उत्पन्न गरिएको कोड यहाँ प्रदान गर्नुहोस्।',
    'mfa_verify_access' => 'पहुँच प्रमाणित गर्नुहोस्',
    'mfa_verify_access_desc' => 'तपाईंको प्रयोगकर्ता खाता थप प्रमाणीकरणको माध्यमबाट आफ्नो पहिचान प्रमाणित गर्नको लागि आवश्यक छ। कृपया अगाडि बढ्नको लागि तपाईंको कन्फिगर गरिएको विधि प्रयोग गर्नुहोस्।',
    'mfa_verify_no_methods' => 'कुनै तरिका कन्फिगर गरिएको छैन',
    'mfa_verify_no_methods_desc' => 'तपाईंको खातामा मल्टि-फ्याक्टर प्रमाणीकरण विधिहरू फेला परेका छैनन्। तपाईंलाई पहुँच प्राप्त गर्न कम्तिमा एक विधि सेटअप गर्न आवश्यक छ।',
    'mfa_verify_use_totp' => 'मोबाइल एप प्रयोग गरेर प्रमाणित गर्नुहोस्',
    'mfa_verify_use_backup_codes' => 'ब्याकअप कोड प्रयोग गरेर प्रमाणित गर्नुहोस्',
    'mfa_verify_backup_code' => 'ब्याकअप कोड',
    'mfa_verify_backup_code_desc' => 'तल तपाईंको बाँकी रहेका ब्याकअप कोडहरू मध्ये एउटा प्रविष्ट गर्नुहोस्:',
    'mfa_verify_backup_code_enter_here' => 'यहाँ ब्याकअप कोड प्रविष्ट गर्नुहोस्',
    'mfa_verify_totp_desc' => 'तपाईंको मोबाइल एपबाट उत्पन्न गरिएको कोड तल प्रविष्ट गर्नुहोस्:',
    'mfa_setup_login_notification' => 'मल्टि-फ्याक्टर विधि कन्फिगर गरिएको छ, कृपया अब कन्फिगर गरिएको विधि प्रयोग गरेर फेरि लगइन गर्नुहोस्।',
];
