<?php
/**
 * Text shown in error messaging.
 */
return [

    // Permissions
    'permission' => 'Немате дозволу да приступите овој страни.',
    'permissionJson' => 'Немате овлашћење да извршите ову акцију.',

    // Auth
    'error_user_exists_different_creds' => 'Корисник са адресом е-поште :email већ постоји са другим приступним подацима.',
    'auth_pre_register_theme_prevention' => 'Кориснички налог није могао бити регистрован са достављеним подацима',
    'email_already_confirmed' => 'Е-пошта је већ потврђена. Покушајте да се пријавите.',
    'email_confirmation_invalid' => 'Овај потврдни токен није исправан или је већ искоришћен. Покушајте да се поново региструјете.',
    'email_confirmation_expired' => 'Потврдни токен је истекао. Послата је нова е-порука за потврду.',
    'email_confirmation_awaiting' => 'Адреса е-поште за налог у употреби мора бити потврђен',
    'ldap_fail_anonymous' => 'LDAP приступ није успео користећи анонимно спајање',
    'ldap_fail_authed' => 'LDAP приступ није успео са наведеним dn и лозинка подацима',
    'ldap_extension_not_installed' => 'LDAP PHP проширење није инсталирано',
    'ldap_cannot_connect' => 'Није могуће повезати се на ldap сервер. Иницијално повезивање није успело',
    'saml_already_logged_in' => 'Већ пријављен',
    'saml_no_email_address' => 'Нисмо могли да пронађемо адресу е-поште за овог корисника у достављеним подацима од стране екстерног система за аутентификацију',
    'saml_invalid_response_id' => 'Захтев од екстерног система за аутентификацију није препознат од стране процеса започетког овом апликацијом. Повратак након пријаве може бити узрок овог проблема.',
    'saml_fail_authed' => 'Пријава користећи :system није успела, систем није доставио успешну ауторизацију',
    'oidc_already_logged_in' => 'Већ пријављен',
    'oidc_no_email_address' => 'Нисмо могли да пронађемо адресу е-поште за овог корисника у достављеним подацима од стране екстерног система за аутентификацију',
    'oidc_fail_authed' => 'Пријава користећи :system није успела, систем није доставио успешну ауторизацију',
    'social_no_action_defined' => 'Није дефинисана радња',
    'social_login_bad_response' => "Добијена је грешка током :socialAccount пријаве: \n:error",
    'social_account_in_use' => 'Овај :socialAccount налог је већ у употреби. Покушајте пријаву са :socialAccount опцијом.',
    'social_account_email_in_use' => 'Ова е-пошта :email је већ у употреби. Ако већ имате налог можете повезати ваш :socialAccount налог у поставкама вашег профила.',
    'social_account_existing' => 'Овај :socialAccount је већ повезан са вашим профилом.',
    'social_account_already_used_existing' => 'Овај :socialAccount налог је већ у употреби од стране другог корисника.',
    'social_account_not_used' => 'Овај :socialAccount налог није повезан ни са једним корисником. Молим вас повежите га у поставкама вашег профила. ',
    'social_account_register_instructions' => 'Ако већ немате налог, можете регистровати налог користећи :socialAccount опцију.',
    'social_driver_not_found' => 'Друштвени прикључак није пронађен',
    'social_driver_not_configured' => 'Ваше поставке за :socialAccount нису исправно подешене.',
    'invite_token_expired' => 'Ова веза позивнице је истекла. Можете покушати да поништите лозинку вашег налога.',
    'login_user_not_found' => 'Корисник за ову радњу није могао бити пронађен.',

    // System
    'path_not_writable' => 'На путању :filePath није се могло отпремити. Потврдите да је уписива на серверу.',
    'cannot_get_image_from_url' => 'Није могуће добити слику из :url',
    'cannot_create_thumbs' => 'Сервер не може да прави сличице. Молим вас проверите да је GD PHP проширење инсталирано.',
    'server_upload_limit' => 'Сервер не дозвољава отпремање ове величине. Молим вас покушајте са мањом датотеком.',
    'server_post_limit' => 'Сервер не може да прими достављену количину података. Покушајте поново са мање података или са мањом датотеком.',
    'uploaded'  => 'Сервер не дозвољава отпремање ове величине. Молим вас покушајте са мањом датотеком.',

    // Drawing & Images
    'image_upload_error' => 'Појавила се грешка током отпремања датотеке',
    'image_upload_type_error' => 'Тип датотеке слике која се отпрема није исправна',
    'image_upload_replace_type' => 'Датотека заменске слике мора бити истог типа',
    'image_upload_memory_limit' => 'Неуспело завршавање отпремања слика и/или прављења сличица због ограничења системских ресурса.',
    'image_thumbnail_memory_limit' => 'Није успело прављење варијација величина слике због ограничења системских ресурса.',
    'image_gallery_thumbnail_memory_limit' => 'Није успело прављење сличица галерије због ограничења системских ресурса.',
    'drawing_data_not_found' => 'Цртеж није могао бити учитан. Датотека цртежа можда више не постоји или ви можда немате дозволе да јој приступите.',

    // Attachments
    'attachment_not_found' => 'Прилог није пронађен',
    'attachment_upload_error' => 'Појавила се грешка током отпремања датотеке прилога',

    // Pages
    'page_draft_autosave_fail' => 'Није успело чување нацрта. Потврдите да имате везу са интернетом пре снимања ове стране',
    'page_draft_delete_fail' => 'Није успело брисање нацрта стране и добављања сачуваног садржаја',
    'page_custom_home_deletion' => 'Није могуће брисање стране док је она подешена као почетна',

    // Entities
    'entity_not_found' => 'Ентитет није пронађен',
    'bookshelf_not_found' => 'Полица није пронађена',
    'book_not_found' => 'Књига није пронађена',
    'page_not_found' => 'Страница није пронађена',
    'chapter_not_found' => 'Поглавље није пронађено',
    'selected_book_not_found' => 'Одабрана књига није пронађена',
    'selected_book_chapter_not_found' => 'Одабрана књига или поглавље није пронађено',
    'guests_cannot_save_drafts' => 'Гости не могу сачувати нацрте',

    // Users
    'users_cannot_delete_only_admin' => 'Не можете обрисати јединог администратора',
    'users_cannot_delete_guest' => 'Не можете обрисати госта',
    'users_could_not_send_invite' => 'Корисник није могао бити направљен јер позивница е-поруком није послата',

    // Roles
    'role_cannot_be_edited' => 'Ова улога се не може мењати',
    'role_system_cannot_be_deleted' => 'Ово је системска улога и не може се мењати',
    'role_registration_default_cannot_delete' => 'Ова улога се не може обрисати док је подешена као подразумевана улога за регистрацију',
    'role_cannot_remove_only_admin' => 'Овај корисник је једини коме је додељена улога администратора. Доделите ову улогу другом кориснику пре покушаја да га уклоните овде.',

    // Comments
    'comment_list' => 'Појавила се грешка током добављања коментара.',
    'cannot_add_comment_to_draft' => 'Не можете додати коментаре нацрту.',
    'comment_add' => 'Појавила се грешка током додавања / измене коментара.',
    'comment_delete' => 'Појавила се грешка током брисања коментара.',
    'empty_comment' => 'Није могуће додати празан коментар.',

    // Error pages
    '404_page_not_found' => 'Страна није пронађена',
    'sorry_page_not_found' => 'Извините, страна коју сте тражили није могла бити пронађена.',
    'sorry_page_not_found_permission_warning' => 'Ако сте очекивали да ова страна постоји, можда немате дозволу да је прегледате.',
    'image_not_found' => 'Слика није пронађена',
    'image_not_found_subtitle' => 'Извините, слика коју сте тражили није могла бити пронађена.',
    'image_not_found_details' => 'Ако сте очекивали да ова слика постоји, можда је обрисана.',
    'return_home' => 'Повратак на почетну',
    'error_occurred' => 'Догодила се грешка',
    'app_down' => ':appName тренутно није дотупно',
    'back_soon' => 'Вратиће се ускоро.',

    // Import
    'import_zip_cant_read' => 'Није се могла прочитати ZIP датотека.',
    'import_zip_cant_decode_data' => 'НИје се могла пронаћи и декодовати ZIP data.json садржај.',
    'import_zip_no_data' => 'Подаци у ZIP датотеци немају очекивани садржај књиге, поглавља или стране.',
    'import_zip_data_too_large' => 'ZIP data.json садржај превазилази максималну величину за отпремање подешену у апликацији.',
    'import_validation_failed' => 'Увоз ZIP-а није прошао потврду са овим грешкама:',
    'import_zip_failed_notification' => 'Неуспео увоз ZIP датотеке.',
    'import_perms_books' => 'Недостају вам неопходне дозволе да правите књиге.',
    'import_perms_chapters' => 'Недостају вам неопходне дозволе да правите поглавља.',
    'import_perms_pages' => 'Недостају вам неопходне дозволе да правите стране.',
    'import_perms_images' => 'Недостају вам неопходне дозволе да правите слике.',
    'import_perms_attachments' => 'Недостају вам неопходне дозволе да правите прилоге.',

    // API errors
    'api_no_authorization_found' => 'Није пронађен токен за ауторизацију у захтеву',
    'api_bad_authorization_format' => 'Токен за ауторизацију је пронађен у захтеву али његов формат делује неисправан',
    'api_user_token_not_found' => 'Није пронађен одговарајући API токен за достављени токен ауторизације',
    'api_incorrect_token_secret' => 'Достављена тајна за пружени коришћени API токен није исправна',
    'api_user_no_api_permission' => 'Власник коришћеног API токена нема дозволе да упућује API позиве',
    'api_user_token_expired' => 'Коришћени токен за ауторизацију је истекао',
    'api_cookie_auth_only_get' => 'Дозвољени су само GET захтеви када се користи API са аутентификацијом заснованом на колачићима',

    // Settings & Maintenance
    'maintenance_test_email_failure' => 'Враћена је грешка током слања пробне е-поруке:',

    // HTTP errors
    'http_ssr_url_no_match' => 'Адреса се не подудара са подешеном за дозвољене SSR домаћине',
];
