<?php

/**
 * Text used for user-preference specific views within bookstack.
 */

return [
    'my_account' => 'Мој налог',

    'shortcuts' => 'Пречице',
    'shortcuts_interface' => 'Подешавања пречица интерфејса',
    'shortcuts_toggle_desc' => 'Овде можете да омогућите или онемогућите пречице тастатуре интерфејса система, које се користе за навигацију и радње.',
    'shortcuts_customize_desc' => 'Можете да прилагодите сваку пречицу испод. Само притисните жељену комбинацију тастера након одабира уноса за пречицу.',
    'shortcuts_toggle_label' => 'Пречице тастатуре се омогућене',
    'shortcuts_section_navigation' => 'Навигација',
    'shortcuts_section_actions' => 'Уобичајене радње',
    'shortcuts_save' => 'Сачувај пречице',
    'shortcuts_overlay_desc' => 'Напомена: Када су пречице омогућене помоћни приказ је доступан притиском на "?" што ће нагласити доступне пречице за радње које су тренутно видљиве на екрану.',
    'shortcuts_update_success' => 'Преференце пречица су ажуриране!',
    'shortcuts_overview_desc' => 'Управљајте пречицама тастатуре које можете да користите за навигацију корисничким интерфејсом.',

    'notifications' => 'Подешавања обавештавања',
    'notifications_desc' => 'Контролишите обавештења е-поштом која добијате када се изврши одређена активност у оквиру система.',
    'notifications_opt_own_page_changes' => 'Обавести ме о изменама страница чији сам власник',
    'notifications_opt_own_page_comments' => 'Обавести ме о коментарима на странама чији сам власник',
    'notifications_opt_comment_mentions' => 'Обавести ме када сам поменут у коментару',
    'notifications_opt_comment_replies' => 'Обавести ме о одговорима на моје коментаре',
    'notifications_save' => 'Сачувај подешавања',
    'notifications_update_success' => 'Преференце обавештења су ажуриране!',
    'notifications_watched' => 'Праћене и игнорисане ставке',
    'notifications_watched_desc' => 'Испод су ставке над којима су примењене прилагођене преференце праћења. Да би сте ажурирали ваше преференце за ове, погледајте ставку па затим пронађите опције праћења у траци са стране.',

    'auth' => 'Приступ и безбедност',
    'auth_change_password' => 'Промени лозинку',
    'auth_change_password_desc' => 'Промените лозинку коју користите за пријављивање у апликацију. Она мора бити дугачка најмање 8 карактера.',
    'auth_change_password_success' => 'Лозинка је ажурирана!',

    'profile' => 'Детаљи о профилу',
    'profile_desc' => 'Управљајте детаљима вашег налога чиме се представљате другим корисницима, поред детаља који се користе за комункацију и персонализацију система.',
    'profile_view_public' => 'Погледај јавни профил',
    'profile_name_desc' => 'Подесите ваше име за приказ које је видљво другим корисницима у систему кроз активности које извршавате и садржај који је у вашем власништу.',
    'profile_email_desc' => 'Ова е-пошта ће се користити за обавештења и, у зависности од система аутентификације, прступ систему.',
    'profile_email_no_permission' => 'На жалост немате дозволу да мењате адресу ваше е-поште. Ако желите да је промените, мораћете да замолите администратора да то уради уместо вас.',
    'profile_avatar_desc' => 'Изаберите слику која ће се користити да се представљате другима у систему. Идеално би требала бити четвртаста и око 256px у ширини и висини.',
    'profile_admin_options' => 'Администраторске опције',
    'profile_admin_options_desc' => 'Додатне опције администраторског нивоа, попут оних за управљање доделама улога, се могу пронаћи у корисничком налогу под опцијом "Поставке > Корисници".',

    'delete_account' => 'Обриши налог',
    'delete_my_account' => 'Обриши мој налог',
    'delete_my_account_desc' => 'Ово ће у потпуности обисати ваш кориснички налог из система. Нећете моћи да повратите овај налог или да поништите ову радњу. Садржај који сте направили, као што су странице и отпремљене слике, ће остати.',
    'delete_my_account_warning' => 'Да ли заиста желите да обришете ваш налог?',
];
