<?php

/**
 * Text used for user-preference specific views within bookstack.
 */

return [
    'my_account' => 'حسابي',

    'shortcuts' => 'الاختصارات',
    'shortcuts_interface' => 'خيارات اختصار واجهة المستخدم',
    'shortcuts_toggle_desc' => 'هنا يمكنك تمكين أو تعطيل اختصارات واجهة نظام لوحة المفاتيح، المستخدمة للتنقل والإجراءات.',
    'shortcuts_customize_desc' => 'يمكنك تخصيص كل اختصار من الاختصارات أدناه. ما عليك سوى الضغط على تركيبة المفاتيح المطلوبة بعد تحديد مدخل الاختصار.',
    'shortcuts_toggle_label' => 'تم تمكين اختصارات لوحة المفاتيح',
    'shortcuts_section_navigation' => 'التنقل',
    'shortcuts_section_actions' => 'الإجراءات المشتركة',
    'shortcuts_save' => 'حفظ الاختصارات',
    'shortcuts_overlay_desc' => 'ملاحظة: عندما يتم تمكين الاختصارات، تتوفر تراكب المساعد عن طريق الضغط على "؟" الذي سيسلط الضوء على الاختصارات المتاحة للإجراءات المرئية حاليا على الشاشة.',
    'shortcuts_update_success' => 'تم تحديث خيارات الاختصار!',
    'shortcuts_overview_desc' => 'إدارة اختصارات لوحة المفاتيح التي يمكنك استخدامها للتنقل في واجهة مستخدم النظام.',

    'notifications' => 'إعدادات الإشعارات',
    'notifications_desc' => 'التحكم في إشعارات البريد الإلكتروني الذي تتلقاها عند إجراء نشاط معين داخل النظام.',
    'notifications_opt_own_page_changes' => 'إشعاري عند حدوث تغييرات في الصفحات التي أملكها',
    'notifications_opt_own_page_comments' => 'إشعاري بشأن التعليقات على الصفحات التي أملكها',
    'notifications_opt_comment_replies' => 'إشعاري عند الردود على تعليقاتي',
    'notifications_save' => 'حفظ اﻹعدادات',
    'notifications_update_success' => 'تم تحديث إعدادات الإشعارات!',
    'notifications_watched' => 'العناصر التي تمت مشاهدتها وتجاهلها',
    'notifications_watched_desc' => 'فيما يلي العناصر التي طُبِّقت عليها إعدادات ساعة مخصصة. لتحديث إعداداتك، استعرض العنصر ثم ابحث عن خيارات الساعة في الشريط الجانبي.',

    'auth' => 'الوصول و الأمان',
    'auth_change_password' => 'تغيير كلمة السر',
    'auth_change_password_desc' => 'غيّر كلمة السر التي تستخدمها لتسجيل الدخول إلى التطبيق. يجب ألا تقل عن 8 أحرف.',
    'auth_change_password_success' => 'تم تحديث كلمة السر!',

    'profile' => 'تفاصيل المِلَفّ الشخصي',
    'profile_desc' => 'إدارة تفاصيل حسابك الذي يمثلك أمام المستخدمين الآخرين، بالإضافة إلى التفاصيل المستخدمة للتواصل وتخصيص النظام.',
    'profile_view_public' => 'عرض المِلَفّ الشخصي العام',
    'profile_name_desc' => 'إعداد اسم العرض الخاص بك الذي سيكون مرئيًا للمستخدمين الآخرين في النظام من خلال النشاط الذي تقوم به والمحتوى الذي تملكه.',
    'profile_email_desc' => 'سيتم استخدام هذا البريد الإلكتروني للإشعارات، وبناءً على مصادقة النظام النشط، سيتم استخدام الوصول إلى النظام.',
    'profile_email_no_permission' => 'للأسف، ليس لديك إذن لتغيير عنوان بريدك الإلكتروني. إذا كنت ترغب في تغييره، فعليك طلب ذلك من أحد المسؤولين.',
    'profile_avatar_desc' => 'اختر صورةً تُمثّلك أمام الآخرين في النظام. يُفضّل أن تكون الصورة مربعةً، وعرضها وارتفاعها حوالي ٢٥٦ بكسل.',
    'profile_admin_options' => 'خيارات المسؤول',
    'profile_admin_options_desc' => 'يمكنك العثور على خيارات إضافية على مستوى المسؤول، مثل تلك الخاصة بإدارة تعيينات الأدوار، لحساب المستخدم الخاص بك في منطقة "الإعدادات > المستخدمون" في التطبيق.',

    'delete_account' => 'حذف الحساب',
    'delete_my_account' => 'حذف حسابي',
    'delete_my_account_desc' => 'سيؤدي هذا إلى حذف حساب المستخدم الخاص بك بالكامل من النظام. لن تتمكن من استعادة هذا الحساب أو التراجع عن هذا الإجراء. سيبقى المحتوى الذي أنشأته، مثل الصفحات التي أنشأتها والصور التي رفعتها، كما هي.',
    'delete_my_account_warning' => 'هل أنت متأكد أنك تريد حذف حسابك؟',
];
