<?php

/**
 * Text used for user-preference specific views within bookstack.
 */

return [
    'my_account' => 'Мій аккаунт',

    'shortcuts' => 'Ярлики',
    'shortcuts_interface' => 'Налаштування ярлика інтерфейсу',
    'shortcuts_toggle_desc' => 'Тут ви можете увімкнути або вимкнути ярлики інтерфейсу клавіатури, які використовуються для навігації та дій.',
    'shortcuts_customize_desc' => 'Ви можете налаштувати кожен з ярликів нижче. Просто натисніть на комбінацію бажаного ключа після вибору вводу для ярлика.',
    'shortcuts_toggle_label' => 'Клавіатурні скорочення увімкнено',
    'shortcuts_section_navigation' => 'Навігація',
    'shortcuts_section_actions' => 'Загальні дії',
    'shortcuts_save' => 'Зберегти ярлики',
    'shortcuts_overlay_desc' => 'Примітка: якщо ярлики ввімкнено, допоміжне накладання доступне, натиснувши "?" який виділить доступні ярлики для дій, які зараз видно на екрані.',
    'shortcuts_update_success' => 'Налаштування ярликів оновлено!',
    'shortcuts_overview_desc' => 'Керуйте комбінаціями клавіатур можна використовувати для навігації інтерфейсу системи користувача.',

    'notifications' => 'Налаштування сповіщень',
    'notifications_desc' => 'Контролюйте сповіщення по електронній пошті, які ви отримуєте, коли виконується певна активність у системі.',
    'notifications_opt_own_page_changes' => 'Повідомляти при змінах сторінок якими я володію',
    'notifications_opt_own_page_comments' => 'Повідомляти при коментарях на моїх сторінках',
    'notifications_opt_comment_replies' => 'Повідомляти про відповіді на мої коментарі',
    'notifications_save' => 'Зберегти налаштування',
    'notifications_update_success' => 'Налаштування сповіщень було оновлено!',
    'notifications_watched' => 'Переглянуті та ігноровані елементи',
    'notifications_watched_desc' => 'Нижче наведені предмети, які мають застосовані налаштування перегляду. Щоб оновити ваші налаштування для них, перегляньте елемент, а потім знайдіть параметри перегляду на бічній панелі.',

    'auth' => 'Доступ і безпека',
    'auth_change_password' => 'Змінити пароль',
    'auth_change_password_desc' => 'Змініть пароль, який ви використовуєте для входу в програму. Це має бути щонайменше 8 символів.',
    'auth_change_password_success' => 'Пароль оновлено!',

    'profile' => 'Деталі профілю',
    'profile_desc' => 'Керуйте інформацією вашого облікового запису, що представляє вам інші користувачі, додатково до деталей, що використовуються для комунікації та особистості системи.',
    'profile_view_public' => 'Перегляд загального профілю',
    'profile_name_desc' => 'Налаштування відображуваного імена, які будуть видимі іншим користувачам в системі через здійснені вами дії та власний контент.',
    'profile_email_desc' => 'Цей email буде використовуватися для сповіщення і в залежності від активної автентифікації системи, доступу до системи.',
    'profile_email_no_permission' => 'На жаль, у вас немає дозволу на зміну адреси електронної пошти. Якщо ви хочете змінити це, ви маєте попросити адміністратора змінити це для вас.',
    'profile_avatar_desc' => 'Виберіть зображення, яке буде використовуватися для того, щоб представити себе іншим у системі. В ідеалі це зображення має бути квадратне і близько 256пікс в ширину і висоту.',
    'profile_admin_options' => 'Параметри адміністратора',
    'profile_admin_options_desc' => 'Додаткові параметри на рівні адміністратора, так як і для управління призначеннями роль, ви можете знайти для вашого облікового запису в області "Налаштування> Користувачі" додатку.',

    'delete_account' => 'Видалити обліковий запис',
    'delete_my_account' => 'Видалити мій обліковий запис',
    'delete_my_account_desc' => 'Це повністю видалить ваш обліковий запис з системи. Ви не зможете відновити або скасувати цю дію. Контент, який Ви створили, наприклад створені сторінки і вивантажені зображення, залишиться.',
    'delete_my_account_warning' => 'Ви впевнені, що хочете видалити свій обліковий запис?',
];
