<?php

/**
 * Text used for user-preference specific views within bookstack.
 */

return [
    'my_account' => 'החשבון שלי',

    'shortcuts' => 'קיצורי דרך',
    'shortcuts_interface' => 'העדפות קיצורי ממשק משתמש',
    'shortcuts_toggle_desc' => 'כאן תוכל להפעיל או לבטל קיצורי דרך לממשק מערכת המקלדת, המשמשים לניווט ולפעולות.',
    'shortcuts_customize_desc' => 'אתה יכול להתאים אישית כל אחד מקיצורי הדרך למטה. פשוט לחץ על צירוף המקשים הרצוי לאחר בחירת הקלט לקיצור דרך.',
    'shortcuts_toggle_label' => 'קיצורי מקשים מופעלים',
    'shortcuts_section_navigation' => 'ניווט',
    'shortcuts_section_actions' => 'פעולות נפוצות',
    'shortcuts_save' => 'שמור קיצורי דרך',
    'shortcuts_overlay_desc' => 'הערה: כאשר קיצורי דרך מופעלים, שכבת-על מסייעת זמינה באמצעות לחיצה על "?" אשר ידגיש את קיצורי הדרך הזמינים לפעולות הנראות כעת על המסך.',
    'shortcuts_update_success' => 'העדפותיך נשמרו!',
    'shortcuts_overview_desc' => 'ניהול קיצורי מקלדת שבשימוש לניווט מהיר בממשק המשתמש.',

    'notifications' => 'הגדרת התראות',
    'notifications_desc' => 'העדפות קבלת מייל והתראות כאשר מבוצעת פעולה מסויימת במערכת.',
    'notifications_opt_own_page_changes' => 'עדכן אותי כאשר מתבצעים שינויים לדפים שבבעלותי',
    'notifications_opt_own_page_comments' => 'עדכן אותי כאשר נוספות הערות לדפים שבבעלותי',
    'notifications_opt_comment_replies' => 'עדכן אותי כאשר מתקבלות תגובות להערות שלי',
    'notifications_save' => 'שמור העדפות',
    'notifications_update_success' => 'הגדרת התראות עודכנו!',
    'notifications_watched' => 'פריטים נצפים וברשימת התעלמות',
    'notifications_watched_desc' => 'להן רשימת הפריטים אשר קיימת עבורם הגדרות מותאמות אישית. על מנת לעדכן רשימה זו, צפה בפריט ומצא את אפשרות הצפייה / מעקב בפאנל הצידי.',

    'auth' => 'גישה ואבטחה',
    'auth_change_password' => 'שינוי סיסמה',
    'auth_change_password_desc' => 'שינוי הסיסמה לכניסה למערכת. הסיסמה חייבת להיות לפחות 8 תווים.',
    'auth_change_password_success' => 'הסיסמה עודכנה בהצלחה!',

    'profile' => 'פרטי הפרופיל',
    'profile_desc' => 'נהל את פרטי החשבון שלך אשר יוצגו לאחרים במערכת, בנוסף לפרטים אשר נועדו להתאמה אישית במערכת ויצירת קשר.',
    'profile_view_public' => 'צפה בפרופיל הציבורי',
    'profile_name_desc' => 'הגדר את שם התצוגה שלך אשר יהיה זמין לצפייה לשאר משתמשי המערכת ובכל פעולה אשר תבצע במערכת, ובתוכן אשר שייך לך.',
    'profile_email_desc' => 'כתובת הדוא"ל תשמש להתראות, ובהתאם למערכות ההזדהות הפעילות לגישה למערכת.',
    'profile_email_no_permission' => 'לצערנו אין לך גישה לביצוע שינוי כתובת הדוא"ל שלך, אם ברצונך לבצע שינוי בכתובת אנא פנה למנהל המערכת על מנת שיבצע שינוי זה עבורך.',
    'profile_avatar_desc' => 'אנא בחר תמונה שתייצג אותך כלפי אחרים במערכת, תמונה אידיאלית צריכה להיות בגובה ואורך של 256 פיקסלים.',
    'profile_admin_options' => 'אפשרויות מנהל',
    'profile_admin_options_desc' => 'אפשרויות ברמת מנהל נוספות, כגון הוספת תפקידים והרשאות למשתמשים, אפשר למצוא עבור המשתמש שלך באיזור "הגדרות > משתמשים" במערכת.',

    'delete_account' => 'הסר חשבון',
    'delete_my_account' => 'הסר את החשבון שלי',
    'delete_my_account_desc' => 'פעולה זו תמחק את החשבון שלך כולל כל ההגדרות עבור החשבון שלך מהמערכת. אין דרך לשחזר את החשבון לאחר המחיקה. כל תוכן שיצרת כולל קבצים שהעלת לאתר ישארו פעילים.',
    'delete_my_account_warning' => 'הפעולה אינה ניתנת לביטול, האם למחוק את החשבון?',
];
