<?php

/**
 * Text used for user-preference specific views within bookstack.
 */

return [
    'preferences' => 'پیکربندی',

    'shortcuts' => 'میانبرها',
    'shortcuts_interface' => 'میانبرهای صفحه کلید',
    'shortcuts_toggle_desc' => 'در اینجا می توانید میانبرهای سیستم را که برای پیمایش و ... استفاده می شود، فعال یا غیرفعال کنید.',
    'shortcuts_customize_desc' => 'می توانید هر یک از میانبرهای زیر را سفارشی کنید. کافی است پس از انتخاب ورودی برای میانبر، کلید ترکیبی مورد نظر خود را فشار دهید.',
    'shortcuts_toggle_label' => 'میانبرهای صفحه کلید فعال شد',
    'shortcuts_section_navigation' => 'ناوبری و پیمایش',
    'shortcuts_section_actions' => 'فعالیت/اقدامات مرسوم',
    'shortcuts_save' => 'ذخیره کلیدهای میانبر',
    'shortcuts_overlay_desc' => 'توجه: هنگامی که میانبرها فعال هستند، یک رابط کمکی با فشار دادن "؟" در دسترس است که میانبرهای موجود برای اقداماتی که در حال حاضر روی صفحه قابل مشاهده است را برجسته می‌کند.',
    'shortcuts_update_success' => 'تنظیمات میانبر به روز شده است!',
    'shortcuts_overview_desc' => 'میانبرهای صفحه کلید را که می توانید برای پیمایش در رابط کاربری سیستم استفاده کنید، مدیریت کنید.',

    'notifications' => 'تنظیمات اعلان',
    'notifications_desc' => 'اعلان‌های ایمیلی را که هنگام انجام فعالیت خاصی در سیستم دریافت می‌کنید، کنترل کنید.',
    'notifications_opt_own_page_changes' => 'در صورت تغییرات در صفحاتی که متعلق به من هستند، اطلاع بده',
    'notifications_opt_own_page_comments' => 'در صورت ثبت نظرات در صفحاتی که متعلق به من هستند، اطلاع بده',
    'notifications_opt_comment_replies' => 'پس از پاسخ به نظرات من اطلاع بده',
    'notifications_save' => 'ذخیره پیکربندی',
    'notifications_update_success' => 'تنظیمات اعلان ها به روز گردید!',
    'notifications_watched' => 'آیتم های تحت نظر و چشم پوشی قرار گرفته شده',
    'notifications_watched_desc' => ' در زیر مواردی برای تنظیمات زیر نطر گرفتن سفارشی وجود دارد. برای به‌روزرسانی این تنظیمات، آیتم را مشاهده و سپس گزینه‌های زیرنظر گرفتن را در نوار کناری پیدا کنید.',

    'profile_overview_desc' => ' جزئیات حساب کاربری خود از جمله زبان ترجیحی و گزینه های احراز هویت را مدیریت کنید.',
];
