<?php

/**
 * Text used for user-preference specific views within bookstack.
 */

return [
    'my_account' => 'حساب کاربری من',

    'shortcuts' => 'میانبرها',
    'shortcuts_interface' => 'تنظیمات کلید‌های میانبر رابط کاربری',
    'shortcuts_toggle_desc' => 'در اینجا می توانید میانبرهای سیستم را که برای پیمایش و... استفاده می شود، فعال یا غیرفعال کنید.',
    'shortcuts_customize_desc' => 'می توانید هر یک از میانبرهای زیر را سفارشی کنید. کافی است پس از انتخاب ورودی برای میانبر، کلید ترکیبی مورد نظر خود را فشار دهید.',
    'shortcuts_toggle_label' => 'میانبرهای صفحه کلید فعال شد',
    'shortcuts_section_navigation' => 'ناوبری و پیمایش',
    'shortcuts_section_actions' => 'فعالیت/اقدامات مرسوم',
    'shortcuts_save' => 'ذخیره کلیدهای میانبر',
    'shortcuts_overlay_desc' => 'توجه: هنگامی که میانبرها فعال هستند، یک رابط کمکی با فشار دادن "؟" در دسترس است که میانبرهای موجود برای اقداماتی که در حال حاضر روی صفحه قابل مشاهده است را برجسته می‌کند.',
    'shortcuts_update_success' => 'تنظیمات میانبر به روز شده است!',
    'shortcuts_overview_desc' => 'مدیریت میانبرهای صفحه کلید برای پیمایش در رابط کاربری سیستم.',

    'interface' => 'تنظیمات رابط کاربری',
    'interface_desc' => 'در اینجا می‌توانید گزینه‌هایی برای شخصی‌سازی ظاهر رابط کاربری برنامه بیابید.',
    'interface_display_mode' => 'حالت نمایش',
    'interface_display_mode_desc' => 'انتخاب کنید که برنامه در حالت تیره نمایش داده شود یا روشن. این تنظیم را همچنین می‌توان از نمای اصلی یا از طریق منوی کشویی پروفایل در نوار بالایی تغییر داد.',
    'layouts' => 'تنظیمات چیدمان رابط کاربری',
    'layouts_desc' => 'چیدمان بخش‌های نمایش‌داده‌شده در رابط کاربری را برای مجموعه‌ای از نماها سفارشی‌سازی کنید.',
    'layout_edit' => 'ویرایش چیدمان',
    'layout_edit_desc' => 'بخش‌ها را بکشید و رها کنید، یا از منوی عملیاتِ موجود در هر بخش استفاده کنید تا نحوه نمایش و موقعیت قرارگیری آن‌ها را در این چیدمانِ رابط کاربری تغییر دهید.',
    'layout_edit_column_hint' => 'در صفحه‌هایی با ابعاد کوچک‌تر، بخش‌های ستون سمت راست روی بخش‌های ستون سمت چپ قرار می‌گیرند.',
    'layout_edit_save' => 'ذخیره چیدمان',
    'layout_edit_layouts' => 'چیدمان ها',
    'layout_edit_back_to_preferences' => 'بازگشت به تنظیمات',
    'layout_edit_left' => 'چپ',
    'layout_edit_right' => 'راست',
    'layout_edit_center' => 'وسط',
    'layout_edit_unused' => 'استفاده نشده',
    'layout_edit_empty' => 'هیچ بخش برای نمایش وجود ندارد',
    'layout_edit_reset_to_defaults' => 'بازگردانی به حالت پیش فرض',
    'layout_update_success' => 'تنظیمات چیدمان به‌روزرسانی شد!',
    'layout_reset_success' => 'تنظیمات چیدمان بازنشانی شد!',

    'notifications' => 'تنظیمات اطلاع‌رسانی',
    'notifications_desc' => 'تنظیمات اطلاعیه‌های ایمیلی هنگام انجام فعالیت‌های خاص در سیستم.',
    'notifications_opt_own_page_changes' => 'در صورت تغییرات در صفحاتی که متعلق به من است، اطلاع بده',
    'notifications_opt_own_page_comments' => 'در صورت ثبت نظر در صفحاتی که متعلق به من است، اطلاع بده',
    'notifications_opt_comment_mentions' => 'وقتی که من در یک نظر تگ شده ام اطلاع بده',
    'notifications_opt_comment_replies' => 'پس از درج پاسخ به روی نظراتی که من ثبت کرده‌ام، اطلاع بده',
    'notifications_save' => 'ذخیره تنظیمات',
    'notifications_update_success' => 'تنظیمات اعلان‌ها به روز شده است!',
    'notifications_watched' => 'موارد مشاهده و رد شده',
    'notifications_watched_desc' => 'در زیر آیتم‌هایی وجود دارد که تنظیمات «نظارت» سفارشی بر آن‌ها اعمال شده است. برای به‌روزرسانی تنظیمات خود در مورد هر کدام از این آیتم‌ها، روی آن کلیک کنید و سپس گزینه‌ی «نظارت» را در نوار کناری پیدا کنید.',

    'auth' => 'دسترسی و امنیت',
    'auth_change_password' => 'تغییر گذرواژه',
    'auth_change_password_desc' => 'گذرواژه‌ای که برای ورود به برنامه استفاده می‌شود، تنظیم کنید. این عبارت باید حداقل 8 کاراکتر باشد.',
    'auth_change_password_success' => 'رمز عبور به روز شد!',

    'profile' => 'جزئیات پروفایل',
    'profile_desc' => 'علاوه بر جزئیاتی که برای ارتباط و شخصی‌سازی سیستم استفاده می‌شود، جزئیات حساب خود را که نشان دهنده شما برای سایر کاربران است، مدیریت کنید.',
    'profile_view_public' => 'مشاهده پروفایل عمومی',
    'profile_name_desc' => 'نام نمایشی خود را تنظیم کنید. این نام بسته به فعالیت شما و محتوای متعلق به شما، برای سایر کاربران سیستم قابل مشاهده است.',
    'profile_email_desc' => 'این ایمیل برای اعلان‌ها و دسترسی به سیستم استفاده خواهد شد.',
    'profile_email_no_permission' => 'متأسفانه شما اجازه تغییر آدرس ایمیل خود را ندارید. برای تغییر این بخش با ادمین سیستم در ارتباط باشید.',
    'profile_avatar_desc' => 'تصویری را انتخاب کنید که برای نمایش حساب کاربری شما به دیگران در این سیستم استفاده شود. در حالت ایده‌آل، این تصویر باید مربع بوده و در عرض و ارتفاع حدود 256 پیکسل باشد.',
    'profile_admin_options' => 'تنظیمات ادمین',
    'profile_admin_options_desc' => 'گزینه‌های اضافی سطح ادمین، در قسمت «تنظیمات > کاربران» یافت می‌شوند.',

    'delete_account' => 'حذف حساب کاربری',
    'delete_my_account' => 'حذف حساب کاربری من',
    'delete_my_account_desc' => 'با این کار حساب کاربری شما به طور کامل از سیستم حذف می‌شود. شما نمی‌توانید این حساب را بازیابی کنید. محتوایی که ایجاد کرده اید، مانند صفحات ایجاد شده و تصاویر آپلود شده، باقی خواهند ماند.',
    'delete_my_account_warning' => 'آیا مطمئن هستید که می‌خواهید حساب کاربری خود را حذف کنید؟',
];
