<?php

/**
 * Text used for user-preference specific views within bookstack.
 */

return [
    'preferences' => 'تنظیمات',

    'shortcuts' => 'میانبرها',
    'shortcuts_interface' => 'میانبرهای صفحه کلید',
    'shortcuts_toggle_desc' => 'در اینجا می توانید میانبرهای سیستم را که برای پیمایش و ... استفاده می شود، فعال یا غیرفعال کنید.',
    'shortcuts_customize_desc' => 'می توانید هر یک از میانبرهای زیر را سفارشی کنید. کافی است پس از انتخاب ورودی برای میانبر، کلید ترکیبی مورد نظر خود را فشار دهید.',
    'shortcuts_toggle_label' => 'میانبرهای صفحه کلید فعال شد',
    'shortcuts_section_navigation' => 'ناوبری و پیمایش',
    'shortcuts_section_actions' => 'فعالیت/اقدامات مرسوم',
    'shortcuts_save' => 'ذخیره کلیدهای میانبر',
    'shortcuts_overlay_desc' => 'توجه: هنگامی که میانبرها فعال هستند، یک رابط کمکی با فشار دادن "؟" در دسترس است که میانبرهای موجود برای اقداماتی که در حال حاضر روی صفحه قابل مشاهده است را برجسته می‌کند.',
    'shortcuts_update_success' => 'تنظیمات میانبر به روز شده است!',
    'shortcuts_overview_desc' => 'مدیریت میانبرهای صفحه کلید برای پیمایش در رابط کاربری سیستم.',

    'notifications' => 'تنظیمات اطلاع‌رسانی',
    'notifications_desc' => 'تنظیمات اطلاعیه‌های ایمیلی هنگام انجام فعالیت‌های خاص در سیستم.',
    'notifications_opt_own_page_changes' => 'در صورت تغییرات در صفحاتی که متعلق به من است، اطلاع بده',
    'notifications_opt_own_page_comments' => 'در صورت ثبت نظر در صفحاتی که متعلق به من است، اطلاع بده',
    'notifications_opt_comment_replies' => 'پس از درج پاسخ به روی نظراتی که من ثبت کرده‌ام، اطلاع بده',
    'notifications_save' => 'ذخیره تنظیمات',
    'notifications_update_success' => 'تنظیمات اعلان‌ها به روز شده است!',
    'notifications_watched' => 'موارد مشاهده و رد شده',
    'notifications_watched_desc' => 'در زیر آیتم‌هایی وجود دارد که تنظیمات «نظارت» سفارشی بر آن‌ها اعمال شده است. برای به‌روزرسانی تنظیمات خود در مورد هر کدام از این آیتم‌ها، روی آن کلیک کنید و سپس گزینه‌ی «نظارت» را در نوار کناری پیدا کنید.',

    'profile_overview_desc' => ' جزئیات نمایه کاربری خود از جمله زبان ترجیحی و گزینه‌های احراز هویت را مدیریت کنید.',
];
