<?php
return [

    /**
     * Buttons
     */
    'cancel' => 'Отмена',
    'confirm' => 'Применить',
    'back' => 'Назад',
    'save' => 'Сохранить',
    'continue' => 'Продолжить',
    'select' => 'Выделить',
    'more' => 'Ещё',

    /**
     * Form Labels
     */
    'name' => 'Имя',
    'description' => 'Описание',
    'role' => 'Роль',

    /**
     * Actions
     */
    'actions' => 'Действия',
    'view' => 'Просмотр',
    'create' => 'Создание',
    'update' => 'Обновление',
    'edit' => 'Редактировать',
    'sort' => 'Сортировать',
    'move' => 'Переместить',
    'reply' => 'Ответить',
    'delete' => 'Удалить',
    'search' => 'Поиск',
    'search_clear' => 'Очистить поиск',
    'reset' => 'Сбросить',
    'remove' => 'Удалить',
    'add' => 'Добавить',

    /**
     * Misc
     */
    'deleted_user' => 'Удалённый пользователь',
    'no_activity' => 'Нет действий для просмотра',
    'no_items' => 'Нет доступных элементов',
    'back_to_top' => 'Вернуться наверх',
    'toggle_details' => 'Подробности',
    'details' => 'Детали',

    /**
     * Header
     */
    'view_profile' => 'Просмотреть профиль',
    'edit_profile' => 'Редактировать профиль',

    /**
     * Email Content
     */
    'email_action_help' => 'Если у вас возникли проблемы с нажатием кнопки ":actionText", то скопируйте и вставьте указанный URL-адрес в свой веб-браузер:',
    'email_rights' => 'Все прова зарезервированы',
];