<?php
return [

    /**
     * Image Manager
     */
    'image_select' => 'Выделить изображение',
    'image_all' => 'Все',
    'image_all_title' => 'Простмотр всех изображений',
    'image_book_title' => 'Просмотр всех изображений загруженных в эту книгу',
    'image_page_title' => 'Просмотр всех изображений загруженных на эту страницу',
    'image_search_hint' => 'Поиск по имени изображения',
    'image_uploaded' => 'Загруженно :uploadedDate',
    'image_load_more' => 'Загрузить ещё',
    'image_image_name' => 'Имя изображения',
    'image_delete_confirm' => 'Это изображение используется на странице ниже. Снова кликните удалить для подтверждения того что вы хотите удалить.',
    'image_select_image' => 'Выделить изображение',
    'image_dropzone' => 'Перетащите изображение или кликните сюда для загрузки',
    'images_deleted' => 'Изображения удалены',
    'image_preview' => 'Предосмотр изображения',
    'image_upload_success' => 'Изображение загружено успешно',
    'image_update_success' => 'Детали изображения успешно обновлены',
    'image_delete_success' => 'Изображение успешно удалено',

];