<?php

/**
 * Text used for user-preference specific views within bookstack.
 */

return [
    'shortcuts' => 'Горячие клавиши',
    'shortcuts_interface' => 'Горячие клавиши интерфейса',
    'shortcuts_toggle_desc' => 'Здесь вы можете включить или отключить горячие клавиши системного интерфейса, используемые для навигации и действий.',
    'shortcuts_customize_desc' => 'Вы можете настроить каждую из горячих клавиш ниже. Просто нажмите комбинацию клавиш после выбора вставки для горячих клавиш.',
    'shortcuts_toggle_label' => 'Горячие клавиши включены',
    'shortcuts_section_navigation' => 'Навигация',
    'shortcuts_section_actions' => 'Общие действия',
    'shortcuts_save' => 'Сохранить горячие клавиши',
    'shortcuts_overlay_desc' => 'Примечание: Когда горячие клавиши включены, вспомогательное наложение доступно через нажатие "?", которая будет подсвечивать доступные горячие клавиши для действий, видимых в настоящее время на экране.',
    'shortcuts_update_success' => 'Настройки горячих клавиш были обновлены!',
];